Documents/РазовыеРасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>РазовыеРасчеты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПокупателями</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоОплатеТруда</xr:Item>
				<xr:Item>AccumulationRegister.ФинансовыйРезультат</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыССотрудниками</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоВыданнымКредитам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КатегорияРаботников</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРасчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КредитныйДокумент</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСПокупателями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСПокупателями</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Comment>Сумма в валюте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КорСчет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Внутренний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Менеджеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КредитныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтделыВМагазинах</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Внутренний</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазделительУчёта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделителиУчёта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыВеденияВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ТипыВеденияВзаиморасчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговору</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказамПоставщику</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РазовыеРасчеты/Ext/ManagerModule.bsl
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблица_ВзаиморасчетыСПокупателями(ДокументСсылкаРазовыеРасчеты, СтруктураДополнительныеСвойства)
	
	запрос = Новый Запрос;
	запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРазовыеРасчеты);
	запрос.УстановитьПараметр("Подразделение", ДокументСсылкаРазовыеРасчеты.Подразделение);
	запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	
	#Область ТекстЗапроса
	// Формирование временной таблицы по расчетам с покупателями.
	запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РазовыеРасчетыСостав.Сотрудник.Контрагент КАК Контрагент,
	|	СУММА(РазовыеРасчетыСостав.Результат) КАК СуммаОплаты,
	|	ЕСТЬNULL(ВзаиморасчетыСПокупателямиОстатки.СуммаОстаток, 0) КАК СуммаОстатокИтого,
	|	РазовыеРасчетыСостав.Сотрудник.СтруктурнаяЕдиница КАК Подразделение
	|ПОМЕСТИТЬ ТаблицаОплат
	|ИЗ
	|	Документ.РазовыеРасчеты.Состав КАК РазовыеРасчетыСостав
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(&МоментВремени, Подразделение = &Подразделение) КАК ВзаиморасчетыСПокупателямиОстатки
	|		ПО РазовыеРасчетыСостав.Сотрудник.Контрагент = ВзаиморасчетыСПокупателямиОстатки.Контрагент
	|ГДЕ
	|	РазовыеРасчетыСостав.Ссылка = &Ссылка
	|	И РазовыеРасчетыСостав.ВидРасчета = ЗНАЧЕНИЕ(Справочник.ВидыРасчетов.УдержаниеЗаКолбасу)
	|
	|СГРУППИРОВАТЬ ПО
	|	РазовыеРасчетыСостав.Сотрудник.Контрагент,
	|	ЕСТЬNULL(ВзаиморасчетыСПокупателямиОстатки.СуммаОстаток, 0),
	|	РазовыеРасчетыСостав.Сотрудник.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВзаиморасчетыСПокупателямиОстатки.Подразделение КАК Подразделение,
	|	ВзаиморасчетыСПокупателямиОстатки.Менеджер КАК Менеджер,
	|	ВзаиморасчетыСПокупателямиОстатки.Контрагент КАК Контрагент,
	|	ВзаиморасчетыСПокупателямиОстатки.КредитныйДокумент КАК КредитныйДокумент,
	|	ВзаиморасчетыСПокупателямиОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОплат.СуммаОплаты КАК СуммаОплаты,
	|	ТаблицаОплат.СуммаОстатокИтого,
	|	ВзаиморасчетыСПокупателямиОстатки.КредитныйДокумент.Дата КАК КредитныйДокументДата
	|ПОМЕСТИТЬ ТаблицаДолги
	|ИЗ
	|	ТаблицаОплат КАК ТаблицаОплат
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(
	|				&МоментВремени,
	|				Подразделение = &Подразделение
	|					И Контрагент.ТипВеденияВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыВеденияВзаиморасчетов.ПоНакладным)) КАК ВзаиморасчетыСПокупателямиОстатки
	|		ПО ТаблицаОплат.Контрагент = ВзаиморасчетыСПокупателямиОстатки.Контрагент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент,
	|	КредитныйДокументДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДолги.Контрагент КАК Контрагент,
	|	ТаблицаДолги.СуммаОстаток,
	|	ЕСТЬNULL(СУММА(ТаблицаДолги1.СуммаОстаток), 0) КАК СуммаОстатокНакопление,
	|	ТаблицаДолги.КредитныйДокумент КАК КредитныйДокумент,
	|	ТаблицаДолги.Подразделение КАК Подразделение,
	|	ТаблицаДолги.Менеджер КАК Менеджер,
	|	ТаблицаДолги.СуммаОплаты,
	|	ТаблицаДолги.СуммаОстатокИтого,
	|	ТаблицаДолги.КредитныйДокументДата КАК КредитныйДокументДата
	|ПОМЕСТИТЬ ДолгиСНакоплением
	|ИЗ
	|	ТаблицаДолги КАК ТаблицаДолги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДолги КАК ТаблицаДолги1
	|		ПО ТаблицаДолги.Контрагент = ТаблицаДолги1.Контрагент
	|			И ТаблицаДолги.КредитныйДокумент > ТаблицаДолги1.КредитныйДокумент
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДолги.Контрагент,
	|	ТаблицаДолги.СуммаОстаток,
	|	ТаблицаДолги.КредитныйДокумент,
	|	ТаблицаДолги.Подразделение,
	|	ТаблицаДолги.Менеджер,
	|	ТаблицаДолги.СуммаОплаты,
	|	ТаблицаДолги.СуммаОстатокИтого,
	|	ТаблицаДолги.КредитныйДокументДата
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент,
	|	КредитныйДокументДата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ВидДвижения КАК ВидДвижения,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.Менеджер КАК Менеджер,
	|	ВложенныйЗапрос.Контрагент КАК Контрагент,
	|	ВложенныйЗапрос.КредитныйДокумент КАК КредитныйДокумент,
	|	СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
	|	ВложенныйЗапрос.КредитныйДокументДата КАК КредитныйДокументДата
	|ПОМЕСТИТЬ ВременнаяТаблицаВзаиморасчетыСПокупателями
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|		ДолгиСНакоплением.Подразделение КАК Подразделение,
	|		ДолгиСНакоплением.Менеджер КАК Менеджер,
	|		ДолгиСНакоплением.Контрагент КАК Контрагент,
	|		ДолгиСНакоплением.КредитныйДокумент КАК КредитныйДокумент,
	|		ВЫБОР
	|			КОГДА ДолгиСНакоплением.СуммаОстатокНакопление + ДолгиСНакоплением.СуммаОстаток > ДолгиСНакоплением.СуммаОплаты
	|				ТОГДА ВЫБОР
	|						КОГДА ДолгиСНакоплением.СуммаОплаты - ДолгиСНакоплением.СуммаОстатокНакопление > 0
	|							ТОГДА ДолгиСНакоплением.СуммаОплаты - ДолгиСНакоплением.СуммаОстатокНакопление
	|						ИНАЧЕ 0
	|					КОНЕЦ
	|			ИНАЧЕ ВЫБОР
	|					КОГДА ДолгиСНакоплением.СуммаОстатокНакопление + ДолгиСНакоплением.СуммаОстаток = ДолгиСНакоплением.СуммаОстатокИтого
	|						ТОГДА ДолгиСНакоплением.СуммаОплаты - ДолгиСНакоплением.СуммаОстатокНакопление
	|					ИНАЧЕ ДолгиСНакоплением.СуммаОстаток
	|				КОНЕЦ
	|		КОНЕЦ КАК Сумма,
	|		ДолгиСНакоплением.КредитныйДокументДата КАК КредитныйДокументДата
	|	ИЗ
	|		ДолгиСНакоплением КАК ДолгиСНакоплением
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|		ТаблицаОплат.Подразделение,
	|		ЗНАЧЕНИЕ(Справочник.Менеджеры.БезМенеджера),
	|		ТаблицаОплат.Контрагент,
	|		ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка),
	|		ТаблицаОплат.СуммаОплаты,
	|		&ПериодКонтроля
	|	ИЗ
	|		ТаблицаОплат КАК ТаблицаОплат
	|	ГДЕ
	|		ТаблицаОплат.Контрагент.ТипВеденияВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыВеденияВзаиморасчетов.ПоДоговору)) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.КредитныйДокумент,
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.КредитныйДокументДата,
	|	ВложенныйЗапрос.ВидДвижения,
	|	ВложенныйЗапрос.Менеджер
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент,
	|	КредитныйДокументДата";

	#КонецОбласти
	
   	запрос.Выполнить();
	
	запрос.Текст = "ВЫБРАТЬ * ИЗ ТаблицаДолги";
	запрос.Текст = "ВЫБРАТЬ * ИЗ ДолгиСНакоплением";
	запрос.Текст = "ВЫБРАТЬ * ИЗ ВременнаяТаблицаВзаиморасчетыСПокупателями";
	
	#Область ТекстЗапроса
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаВзаиморасчетыСПокупателями.Подразделение КАК Подразделение,
	|	ВременнаяТаблицаВзаиморасчетыСПокупателями.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаВзаиморасчетыСПокупателями.Менеджер КАК Менеджер,
	|	ВременнаяТаблицаВзаиморасчетыСПокупателями.КредитныйДокумент КАК КредитныйДокумент
	|ИЗ
	|	ВременнаяТаблицаВзаиморасчетыСПокупателями";
	#КонецОбласти
	
	результатЗапроса = запрос.Выполнить();
	
	//Блокировка = Новый БлокировкаДанных;
	//ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ВзаиморасчетыСПокупателями");
	//ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	//ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	//
	//Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
	//	ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	//КонецЦикла;
	//Блокировка.Заблокировать();

    НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателями(Запрос.МенеджерВременныхТаблиц, Истина, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("Таблица_ВзаиморасчетыСПокупателями", МассивРезультатов[НомерЗапроса].Выгрузить());

	
КонецПроцедуры


// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства"..
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаРазовыеРасчеты, СтруктураДополнительныеСвойства) Экспорт
	
	запрос = Новый Запрос;
	запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	#Область ТекстЗапроса
	запрос.Текст =
	"ВЫБРАТЬ
	|	РазовыеРасчетыСостав.Ссылка.Дата КАК Период,
	|	&Подразделение КАК Подразделение,
	|	РазовыеРасчетыСостав.Сотрудник,
	|	РазовыеРасчетыСостав.ВидРасчета,
	|	РазовыеРасчетыСостав.Результат,
	|	РазовыеРасчетыСостав.Сотрудник.Контрагент
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.РазовыеРасчеты.Состав КАК РазовыеРасчетыСостав
	|ГДЕ
	|	РазовыеРасчетыСостав.Ссылка = &Ссылка";
	#КонецОбласти
	
	запрос.УстановитьПараметр("Ссылка", ДокументСсылкаРазовыеРасчеты);
	запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	запрос.УстановитьПараметр("Подразделение", ДокументСсылкаРазовыеРасчеты.Подразделение);
	
	запрос.ВыполнитьПакет();
	
	запрос.Текст = "ВЫБРАТЬ * ИЗ ВременнаяТаблицаЗапасы";
	
	// Формирование проводок документа.
	//УправлениеНебольшойФирмойСервер.СформироватьТаблицуПроводок(ДокументСсылкаРасходнаяНакладная, СтруктураДополнительныеСвойства);
	
	СформироватьТаблица_ВзаиморасчетыСПокупателями(ДокументСсылкаРазовыеРасчеты, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()
